
__author__ = 'Ханаев Валентин'

# Задача-1: Дано произвольное целое число, вывести самую большую цифру этого числа.
# Например, дается x = 58375.
# Нужно вывести максимальную цифру в данном числе, т.е. 8.
# Подразумевается, что мы не знаем это число заранее.
# Число приходит в виде целого беззнакового.
# Подсказки:
# * постарайтесь решить задачу с применением арифметики и цикла while;
# * при желании и понимании решите задачу с применением цикла for.

max_digit = 0
input_number = int(input('введите число: '))
while input_number>0 and max_digit<9:
    digit = input_number%10
    if digit>max_digit:
        max_digit = digit
    input_number = input_number//10
print('максимальная цифра: ', max_digit)

# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Решите задачу, используя только две переменные.
# Подсказки:
# * постарайтесь сделать решение через действия над числами;
# * при желании и понимании воспользуйтесь синтаксисом кортежей Python.

first_number = int(input('введите первое число: '))
second_number = int(input('введите второе число: '))
first_number += second_number
second_number = first_number - second_number
first_number -= second_number
print('новое значение первой переменной:', first_variable)
print('новое значение второй переменной:', second_variable)

# Задача-3: Напишите программу, вычисляющую корни квадратного уравнения вида
# ax² + bx + c = 0.
# Коэффициенты уравнения вводятся пользователем.
# Для вычисления квадратного корня воспользуйтесь функцией sqrt() модуля math:
# import math
# math.sqrt(4) - вычисляет корень числа 4

import math
a = int(input('введите коэффициент a: '))
b = int(input('введите коэффициент b: '))
c = int(input('введите коэффициент c: '))

D2 = b**2 - 4*a*c
if D2<0:
    print('корней уравнения нет')
elif D2>0:
    if a: # a!=0
        D = math.sqrt(D2)
        x1 = (-b-D)/(2*a)
        x2 = (-b+D)/(2*a)
        print('первый корень:', x1)
        print('второй корень:', x2)
    else: # a=0
        x = -c/b
        print('один корень:', x)
else: # D=0
    if a: # a!=0
        x = -b/(2*a)
        print('один корень:', x)
    else: # a=0, b=0
        if c: #c!=0
            print('корней уравнения нет')
        else: 
            print('любой x подходит')
